const API_KEY = '30550641-0f108504ecdb994905cf7394f';
export const params = new URLSearchParams({
  key: API_KEY,
  page: '1',
  per_page: '40',
  image_type: 'photo',
  orientation: 'horizontal',
  safesearch: 'true',
  q: '',
});

//todo HTTP-запити
//! Для бекенду використовуй публічний API сервісу Pixabay. Зареєструйся, отримай свій унікальний ключ доступу і ознайомся з документацією.

//? Список параметрів рядка запиту, які тобі обов'язково необхідно вказати:

//* key - твій унікальний ключ доступу до API.
//* q - термін для пошуку. Те, що буде вводити користувач.
//* image_type - тип зображення. На потрібні тільки фотографії, тому постав значення photo.
//* orientation - орієнтація фотографії. Постав значення horizontal.
//* safesearch - фільтр за віком. Постав значення true.
//? У відповіді буде масив зображень, що задовольнили критерії параметрів запиту. Кожне зображення описується об'єктом, з якого тобі цікаві тільки наступні властивості:
